import { Post } from './post';

export const DummyPost: Post = {
  	unique_id: 1,
  	title: 'הפנסיה שלכם שווה יותר',
  	body: 'פרויקט פנסיה פתוחה, מבית הסדנא לידע ציבורי, שם לו למטרה לחשוף את הדרך שבה כספי הפנסיה שלנו מנוהלים וכיצד הם מושקעים. באמצעות פנסיה פתוחה, תוכלו לגלות גם איך מושקעים כספי הפנסיה של הציבור כולו, וגם איך מושקעים כספי הפנסיה בקופה ספציפית על שאלות כמו וכאן עומר ממשיך לכתוב סתם טקסט.',
  	author: 'James Richardson',
  	created_at: new Date(),
  	publish: new Date(),
  	tags: ['boom', 'bam']
  };
