/**
 * Returns the list of companies and their identifier.
 */
export function getCompanies() {
    return [
        {
            Id: "510773922",
            Label: "ארם"
        },
        {
            Id: "510806870",
            Label: "רעות"
        },
        {
            Id: "510927536",
            Label: "אחים ואחיות"
        },
        {
            Id: "510930654",
            Label: "רופאים"
        },
        {
            Id: "510930670",
            Label: "יהב פרח"
        },
        {
            Id: "510960586",
            Label: "אוניברסיטה העברית "
        },
        {
            Id: "511751513",
            Label: "הפניקס"
        },
        {
            Id: "511880460",
            Label: "אנליסט"
        },
        {
            Id: "512008335",
            Label: "קו הבריאות"
        },
        {
            Id: "512065202",
            Label: "מיטב דש"
        },
        {
            Id: "512227265",
            Label: "הלמן"
        },
        {
            Id: "512237744",
            Label: "מגדל"
        },
        {
            Id: "512244146",
            Label: "כלל"
        },
        {
            Id: "512245812",
            Label: "מנורה"
        },
        {
            Id: "512267592",
            Label: "הראל"
        },
        {
            Id: "512362914",
            Label: "עובדי חברת החשמל"
        },
        {
            Id: "513026484",
            Label: "אקסלנס"
        },
        {
            Id: "513173393",
            Label: "אלטשולר"
        },
        {
            Id: "513611509",
            Label: "ילין"
        },
        {
            Id: "513621110",
            Label: "אינפיניטי"
        },
        {
            Id: "513765347",
            Label: "פסגות"
        },
        {
            Id: "513910703",
            Label: "איי. די. איי"
        },
        {
            Id: "514956465",
            Label: "מור (אינטרגמל)"
        },
        {
            Id: "515447035",
            Label: "עובדי חברת החשמל"
        },
        {
            Id: "520004078",
            Label: "הראל"
        },
        {
            Id: "520004896",
            Label: "מגדל"
        },
        {
            Id: "520005497",
            Label: "עובדי בנק לאומי"
        },
        {
            Id: "520019688",
            Label: "עמיתים"
        },
        {
            Id: "520020447",
            Label: "עמיתים"
        },
        {
            Id: "520020504",
            Label: "עמיתים"
        },
        {
            Id: "520022351",
            Label: "עמיתים"
        },
        {
            Id: "520022518",
            Label: "סוכנות היהודית"
        },
        {
            Id: "520022963",
            Label: "עמיתים"
        },
        {
            Id: "520023185",
            Label: "הפניקס"
        },
        {
            Id: "520024647",
            Label: "כלל"
        },
        {
            Id: "520024985",
            Label: "עגור"
        },
        {
            Id: "520027954",
            Label: "אקדמאים במדעי החברה והרוח "
        },
        {
            Id: "520028861",
            Label: "משפטנים"
        },
        {
            Id: "520029620",
            Label: "ביוכימאים  ומקרוביולוגים "
        },
        {
            Id: "520030198",
            Label: "רוקחים"
        },
        {
            Id: "520030693",
            Label: "שיבולת"
        },
        {
            Id: "520030743",
            Label: "שופטים"
        },
        {
            Id: "520030941",
            Label: "ק.ל.ע עובדים סוציאליים"
        },
        {
            Id: "520030993",
            Label: "פקידים עובדי המנהל והשירותים "
        },
        {
            Id: "520031659",
            Label: "עוצ\"מ"
        },
        {
            Id: "520031824",
            Label: "עובדי רשויות מקומיות"
        },
        {
            Id: "520032269",
            Label: "עובדי מדינה"
        },
        {
            Id: "520042169",
            Label: "איילון"
        },
        {
            Id: "520042177",
            Label: "הכשרה"
        },
        {
            Id: "520042540",
            Label: "מנורה"
        },
        {
            Id: "520042573",
            Label: "עובדים סוציאליים"
        },
        {
            Id: "520042581",
            Label: "עמ\"י"
        },
        {
            Id: "520042607",
            Label: "הנדסאים וטכנאים"
        },
        {
            Id: "520042615",
            Label: "מחר"
        },
        {
            Id: "520042631",
            Label: "שובל"
        },
        {
            Id: "570002618",
            Label: "עובדי עריית תל אביב"
        },
        {
            Id: "570005850",
            Label: "עמיתים"
        },
        {
            Id: "570005959",
            Label: "עובדי עירית חיפה"
        },
        {
            Id: "570007476",
            Label: "עמיתים"
        },
        {
            Id: "570009449",
            Label: "עוצ\"צ"
        },
        {
            Id: "570009852",
            Label: "עמיתים"
        },
        {
            Id: "570011767",
            Label: "עובדי אל על נתיבי אוויר לישראל  אגודה שיתופית"
        },
        {
            Id: "570014928",
            Label: "התעשייה האוירית"
        }
    ]
}

/**
 * Returns the list of system fields.
 */
export function getSystemFields() {
    return [
        {Id: "", Label: "הכל"},
        {Id: "300001", Label: "ביטוח"},
        {Id: "300002", Label: "פנסיה"},
        {Id: "300003", Label: "גמל"},
    ];
}

/**
 * Returns the list of reports types.
 */
export function getReportsType() {
    return [
        {Id: "", Label: "הכל"},
        {Id: "71100004", Label: "דוח תקופתי רבועני ביטוח בקובץ PDF"},
        {Id: "71100028", Label: "דוח תקופתי רבעוני בקובץ PDF - פנסיה"},
        {Id: "71100071", Label: "רשימת נכסים ברמת נכס בודד - Public - חברה - ביטוח"},
        {Id: "71100074", Label: "רשימת נכסים ברמת נכס בודד - Public - חברה - פנסיה"},
        {Id: "71100072", Label: "רשימת נכסים ברמת נכס בודד - Public - מסלול ביטוח"},
        {Id: "71100075", Label: "רשימת נכסים ברמת נכס בודד - Public - מסלול פנסיה"},
        {Id: "71100077", Label: "רשימת נכסים ברמת נכס בודד - Public - מוצר - פנסיה"},
    ];
}
